# running in uart_full_prove_v3/src/
read -formal uart_full.v
read -formal uart_tx.v
read -formal uart_rx.v
read -formal uart_full_formal_v3.sv
prep -top uart_full_formal_v3

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
